import Link from "next/link";
import { BaseLayout } from "@/components/Common/BaseLayout";
import { Button } from "@/components/ui/button";

export default async function TermsPage() {
    return (
        <BaseLayout>
            <section className="w-full bg-[#f5f5f5] border-t border-gray-200">

                {/* Title */}
                <div className="mb-6 page_ttl relative">
                    <div className="max-w-[1440px] mx-auto px-4 sm:px-6 lg:px-8 py-10">
                        <h2 className="text-2xl sm:text-3xl font-semibold text-gray-800 relative inline-block ">
                            წესები და პირობები
                            <span className="absolute left-0 -bottom-5 w-20 h-[1px] bg-[#F15A24] z-10"></span>
                        </h2>
                    </div>
                </div>
                {/* Content */}
                <div className=" max-w-[1440px] mx-auto px-4 sm:px-6 lg:px-8 pb-10">
                    {/* Left Text */}
                    <div className="bg-white border border-[#E2E2E2] p-10 text-gray-700 text-sm sm:text-base leading-relaxed space-y-4">
                        <p className="font-semibold">გარანტია/შეცვლა</p>
                        <p>გაუგებრობის თავიდან აცილების მიზნით, გთხოვთ ყურადღებით გაეცნოთ საგარანტიო პირობებს დამომსახურების წესებს.</p>
                        <p className="font-semibold pt-6">გარანტია/შეცვლა</p>
                        <ul className="list-disc list-inside space-y-4 pb-6">
                            <li>გასულია საგარანტიო ვადა</li>
                            <li>საგარანტიო ტალონი არ არის წარმოდგენილი</li>
                            <li>საგარანტიო ტალონში მონაცემები შეცვლილია, წაშლილია ან გადაკეთებულია;</li>
                            <li>საგარანტიო საბუთში არ ემთხვევა პროდუქტის ბრენდი, მოდელი, გაყიდვის თარიღი. საგარანტიო საბუთში არ არისმოცემული კომპანიის ბეჭდი ან მაღაზიის წარმომადგენლის ხელმოწერა.</li>
                            <li>ნივთს აღენიშნება მექანიკური, თერმული ან წყლის მიერ გამოწვეული დაზიანება</li>
                            <li>პროდუქტის კომპლექტაცია არ არის წარმოდგენილი სრულყოფილად</li>
                            <li>ნივთი დაზიანდა არასწორი ექსპლოტაციის მიზეზით</li>
                            <li>თუ ნივთი არაა საწარმოო ან კომერციული დანიშნულების და დაზიანდა კომერციული დანიშნულებით გამოყენებისას</li>
                            <li>პროდუქტის დაზიანება გამოწვეულია ელექტრო გაუმართაობით</li>
                            <li>ნივთი შეკეთებულია ან “გახსნილია” თვითნებურად, ან არაოფიციალურ სერვისცენტრებთან.</li>
                            <li>ნივთი დაზიანდა მესამე პირის მიერ არასწორი მონტაჟის ან ჩართვის დროს. არ იქნა გათვალისწინებული სამომხმარებლოინსტრუქციაში არსებული საექსპლუატაციო პირობები</li>
                            <li>აქსესუარებზე (მათ შორის: ელემენტი, თავაკი, ყურსასმენი, დამტენი მოწყობილობა და სხვა) არ ვრცელდება საგარანტიოპირობები</li>
                            <li>დაზიანება გამოწვეულია კომპიუტერული ვირუსის ან შეუსაბამო ფაილ(ებ)ის მიერ</li>
                            <li>მოწყობილობის სახარჯი მასალები გამოყენებულია ექსპლუატაციის პირობების დარღვევით</li>
                        </ul>
                        <p className="font-semibold pt-6">საგარანტიო მომსახურების მისაღებად აუცილებელია ქვემოთ მოცემული პირობები სრულად იყოს დაცული:</p>
                        <ul className="list-disc list-inside space-y-4 pb-6">
                            <li>საგარანტიო პერიოდი იანგარიშება, ნივთის საგარანტიო ფურცელზე მითითებული თარიღიდან.</li>
                            <li>საგარანტიო მომსახურების მისაღებად მომხმარებელი ვალდებულია დაუკავშირდეს Baba.ge - ს წარმომადგენელს, რომელიც მას გადაამისამართებს შესაბამის სერვისცენტრში.</li>
                            <li>საგარანტიო მომსახურების მისაღებად მომხმარებელმა აუცილებლად უნდა წარმოადგინოს საგარანტიო ტალონი, რომელიცშეიცავს პროდუქტის გაყიდვის თარიღს, პროდუქტის ბრენდს, მოდელს, მაღაზიის ბეჭედსა და ხელმოწერას</li>
                            <li>ნივთის შეძენიდან ორი სამუშაო დღის განმავლობაში, ქარხნული წუნის აღმოჩენის შემთხვევაში, პროდუქტი წარედგინებასერვისცენტრს. პრობლემის დადასტურების შემთხვევაში, პროდუქტი ექვემდებარება შეცვლას. ქარხნული წუნისდაფიქსირების შემთხვევაში, ნივთის შეცვლა მოხდება შესაბამისი პროცედურების დასრულებისთანავე. ნივთიმომხმარებელმა უნდა წარმოადგინოს დაუზიენებელი ყუთით, სრული შეფუთვით, კომპლექტაციითა და ყოველგვარიმექანიკური დაზიანების გარეშე.</li>
                            <li>თუ ქარხნული წუნის აღმოჩენა მოხდა პროდუქტის შეძენიდან ერთი სამუშაო დღის გასვლის შემდგომ, ნივთიექვემდებარება შეკეთებას</li>
                            <li>თუ სერვისცენტრი ვერ ახერხებს ნივთის შეკეთებას და მისი სათანადო დეტალებით უზრუნველყოფას ორმაცდახუთი (45) სამუშაო დღის განმავლობაში, ნივთი ექვემდებარება შეცვლას. იმ შემთხვევაში, თუ ვერ ხერხდება არსებული ნივთის იმავემოდელით ჩანაცვლება და მომხმარებელი არ არის თანახმა მისი სხვა მსგავსი ფუნქციონალისა და ფასის მოდელითჩანაცვლებაზე, მაღაზია ვალდებულია გააუქმოს შეკვეთა და შეკვეთაში გადახდილი თანხა დაუბრუნოს მომხმარებელს</li>
                        </ul>
                        <p className="font-semibold pt-6">ნივთის შეცვლა დაშვებულია მხოლოდ ქვემოთ ჩამოთვლილ შემთხვევებში:</p>
                        <ul className="list-disc list-inside space-y-4 pb-6">
                            <li>შეძენილი ნივთის მიღებისთანავე შეამოწმეთ მისი ვიზუალური მდგომარეობა baba.ge-ს  წარმომადგენლის თანდასწრებით, თუ დაუფიქსირდება ვიზუალური დეფექტი, ნივთი შეიცვლება კომპანიის მიერ დადგენილი წესით.</li>
                            <li>პროდუქტის უკან დაბრუნება ან შეცვლა შესაძლებელია მხოლოდ იმ შემთხვევაში, თუ პროდუქტის მახასიათებლები არემთხვევა საიტზე არსებულ ტექნიკური მახასიათებლების აღწერასა და მის ვიზუალურ მხარეს. პროდუქტის შეცვლა ან უკანდაბრუნება შესაძლებელია მისი შეძენიდან ორი სამუშაო დღის განმავლობაში</li>
                            <li>თუ შეძენილ ნივთს გაყიდვიდან 1(ერთი) დღის განმავლობაში აღმოაჩნდება ქარხნული დეფექტი, მყიდველმა დაზიანებულინივთი აღნიშნულ ვადაში უნდა შეატყობინოს baba.ge-ს. იმ შემთხევაში, თუ დასკვნით დადასტურდება ქარხნულიდეფექტი, ნივთი შეიცვლება კომპანიის მიერ დადგენილი წესით;</li>
                            <li>თუ ნივთი ვერ შეკეთდა რეკომენდირებულ სერვის ცენტრში მიტანიდან 60 (სამოცი) კალენდარული დღის განმავლობაში, ნივთი შეიცვლება კომპანიის მიერ დადგენილი წესით, მომსახურე სერვის ცენტრის მიერ გაცემული შესაბამისი ტექნიკურიდასკვნის საფუძველზე.</li>
                            <li>ნივთის შეცვლა დაშვებულია მხოლოდ სრული კომპლეტქაციით, აუცილებელია ყუთის და აქსესუარების შენახვა.</li>
                            <li>ნივთის შეცვლა ხდება იგივე ან მეტი (განსხვავების დაფარვით) ღირებულების, შეცვლის მომენტში გაყიდვაში არსებულინივთით.</li>
                            <li>შეცვლისას ნივთის ღირებულება განისაზღვრება მისი შეძენისას გადახდილი ფასით. გაცვლის შემთხვევაში (როცაგაყიდვაში არ არის იგივე ნივთი) ნივთის ღირებულება განისაზღვრება შეძენისას გადახდილ და გასაცვლელი ნივთისფასებიდან უმცირესით.</li>
                            <li>ფორსმაჟორული მდგომარეობისას, მომხმარებელთან შეთანხმების გარეშე shop.baba.ge უფლებამოსილია შეიტანოსკორექტივები წინამდებარე პირობებში, საგარანტიო ვალდებულებებსა და სარემონტო ვადებში.</li>
                            <li>წინამდებარე საგარანტიო პირობები ძალაში შედის პროდუქტის გაყიდვის მომენტიდან.</li>
                            <li>ინტერნეტ მაღაზია არ იბრუნებს და არ ცვლის პროდუქტს იმ შემთხვევაში, თუ ნივთი აღარ მოგწონთ, საჭიროდ აღარ მიიჩნევთ მის ფლობას, არ ამართლებს თქვენს მოლოდინს და სხვა მსგავსი მიზეზების გამო</li>
                        </ul>
                    </div>
                </div>
            </section>
        </BaseLayout>
    )
}
